#+title: Reproduction tools for GNU Emacs Bug Report <?>

Emacs is receiving a SIGABRT (Fatal Error 6) with error message
~munmap_chunk(): invalid pointer~ when parsing any file with the
[[https://github.com/MichaHoffmann/tree-sitter-hcl][tree-sitter-hcl]] grammar. The crash only occurs when Emacs is built with
PGTK.

I am not sure if this is a bug in the grammar or in Emacs itself.  The
fact that the bug only happens with a PGTK build of Emacs leads me to
believe that the bug is within Emacs. However, the crash does not occur
with the ~v1.1.0~ release of the grammar, and so the bug may lay in the
newly rewritten scanner added to the tree-sitter-hcl repo since that
release.

* Environment info
Output of ~M-x emacs-version~ in the most minimal environment in which I
reproduced this crash (the ~pgtk.dockerfile~ in this repo)

#+begin_src sh :results output replace
docker container run --rm emacs-29-bugreport-pgtk:latest \
    emacs --batch \
    -eval '(princ (emacs-version))' \
    -eval '(princ "\n")' \
    -eval '(princ system-configuration-options)' \
    -eval '(princ "\n")' \
    -eval '(princ system-configuration-features)'
#+end_src

#+RESULTS:
: GNU Emacs 29.1.50 (build 1, x86_64-pc-linux-gnu, GTK+ Version 3.24.38, cairo version 1.17.8)
:  of 2023-10-14
: --with-tree-sitter --with-pgtk CFLAGS=-g
: CAIRO DBUS FREETYPE GLIB GMP GNUTLS GSETTINGS HARFBUZZ JPEG LIBSELINUX LIBXML2 MODULES NOTIFY INOTIFY PDUMPER PGTK PNG SECCOMP SOUND THREADS TIFF TOOLKIT_SCROLL_BARS TREE_SITTER XIM GTK3 ZLIB

At time of writing, Emacs is built from commit ~8141d73~ within the
containers.

Operating systm info from the container:

#+begin_src sh :results output replace
docker container run -it --rm emacs-29-bugreport-pgtk:latest \
    cat /etc/os-release
#+end_src

#+RESULTS:
#+begin_example
NAME="Fedora Linux"
VERSION="38 (Container Image)"
ID=fedora
VERSION_ID=38
VERSION_CODENAME=""
PLATFORM_ID="platform:f38"
PRETTY_NAME="Fedora Linux 38 (Container Image)"
ANSI_COLOR="0;38;2;60;110;180"
LOGO=fedora-logo-icon
CPE_NAME="cpe:/o:fedoraproject:fedora:38"
DEFAULT_HOSTNAME="fedora"
HOME_URL="https://fedoraproject.org/"
DOCUMENTATION_URL="https://docs.fedoraproject.org/en-US/fedora/f38/system-administrators-guide/"
SUPPORT_URL="https://ask.fedoraproject.org/"
BUG_REPORT_URL="https://bugzilla.redhat.com/"
REDHAT_BUGZILLA_PRODUCT="Fedora"
REDHAT_BUGZILLA_PRODUCT_VERSION=38
REDHAT_SUPPORT_PRODUCT="Fedora"
REDHAT_SUPPORT_PRODUCT_VERSION=38
SUPPORT_END=2024-05-14
VARIANT="Container Image"
VARIANT_ID=container
#+end_example

This matches the environment of the system I am running, which is using
the Sway spin of Fedora 38. I have also observed the crash when running
a PGTK build of Emacs in WSL2 on Windows, but I do not have access to
that machine as I am writing this and so cannot provide full info.

The version of ~libtree-sitter~ is ~0.20.8~.

